#+STARTUP: indent
* LTD                                                                   :LEO:
** CANC have my blog added to Planet emacs
CLOSED: [2015-06-01 Mon 13:02] SCHEDULED: <2015-06-01 Mon>
:LOGBOOK:
- State "CANC"       from ""           [2015-06-01 Mon 13:02]
- Note taken on [2015-04-13 Mon 14:03] \\
  follow up, see if my blog was added.
:END:
*** DONE Write to: https://twitter.com/hober
CLOSED: [2015-04-13 Mon 14:02]
** DONE Accept my E.S.O answer
CLOSED: [2015-04-13 Mon 13:50] SCHEDULED: <2015-04-11 Sat>
http://emacs.stackexchange.com/questions/10595/how-to-strike-out-done-items-in-org-mode/10614#10614
** DONE accept my untar question
CLOSED: [2015-04-30 Thu 12:31] SCHEDULED: <2015-04-27 Mon>
http://unix.stackexchange.com/questions/198151/tar-extract-into-directory-with-same-base-name/198161
** TODO [#C] Read Emacs Mailing List
 SCHEDULED: <2015-07-25 Sat .+4d/12d>
:PROPERTIES:
:LAST_REPEAT: [2015-07-21 Tue 16:47]
:END:
:LOGBOOK:  
- State "DONE"       from "TODO"       [2015-07-21 Tue 16:47]
- State "DONE"       from "TODO"       [2015-07-17 Fri 12:38]
- State "DONE"       from "TODO"       [2015-07-07 Tue 11:21]
- State "DONE"       from "TODO"       [2015-06-29 Mon 13:32]
- State "DONE"       from "TODO"       [2015-06-22 Mon 14:33]
- State "DONE"       from "TODO"       [2015-06-15 Mon 11:47]
- State "DONE"       from "TODO"       [2015-06-08 Mon 12:44]
- State "DONE"       from "TODO"       [2015-06-02 Tue 11:19]
- State "DONE"       from "TODO"       [2015-05-29 Fri 14:02]
- State "DONE"       from "TODO"       [2015-05-25 Mon 12:00]
- State "DONE"       from "TODO"       [2015-05-19 Tue 11:14]
- State "DONE"       from "TODO"       [2015-05-12 Tue 09:50]
- State "DONE"       from "TODO"       [2015-05-08 Fri 11:43]
- State "DONE"       from "TODO"       [2015-05-04 Mon 13:29]
- State "DONE"       from "TODO"       [2015-04-30 Thu 12:51]
- State "DONE"       from "TODO"       [2015-04-21 Tue 11:10]
- State "DONE"       from "TODO"       [2015-04-17 Fri 11:10]
- State "DONE"       from "TODO"       [2015-04-13 Mon 14:13]
- State "DONE"       from "TODO"       [2015-04-06 Mon 14:28]
- State "DONE"       from "TODO"       [2015-03-27 Fri 11:23]
:END:      
:PROPERTIES:
:STYLE:    habit
:LAST_REPEAT: [2015-04-06 Mon 14:28]
:END:
** DONE accept SO answer.
CLOSED: [2015-04-30 Thu 12:30] SCHEDULED: <2015-04-24 Fri>
http://emacs.stackexchange.com/questions/10837/how-to-make-company-mode-be-case-sensitive-on-plain-text/10838
** TODO [#C] migrate back to mac maybe?

Emacs brew install:
https://github.com/jkitchin/jmax#mac-users

maybeh: 
,----[ emacs-install ]
| #!/usr/local/bin/bash
| brew update
| brew unlink emacs
| brew uninstall emacs
| brew install emacs --HEAD --use-git-head --cocoa --with-gnutls --with-rsvg --with-imagemagick
| brew linkapps
`----

Latex
https://tug.org/mactex/


MEH:
 - Retired emacs mac port:
https://github.com/railwaycat/emacs-mac-port
** TODO [#C] Migrate my notes to org files. 
 - [ ] SWT
 - [ ] git
 - [ ] Python
 - [ ] Java
** TODO [#C] Learn tMux and bind it to emacs-like keys.

Tutorials:
https://justin.abrah.ms/dotfiles/tmux.html

Emacs & collaborative editing via tmux
http://emacswiki.org/emacs/tmux_for_collaborative_editing

Read a little about setup:
https://nathan.ca/2014/06/dotfiles/

Example of tmux for emacs & vim usage:
http://superuser.com/questions/382102/using-tmux-with-both-emacs-and-vim

Emacs to tMux commands:
http://bradylove.com/blog/2013/05/24/commanding-tmux-with-emacs/

** TODO [#C] Try out power-top energy savings
http://en.wikipedia.org/wiki/PowerTOP
** LDONE
*** DONE follow up on open links in firefox 
CLOSED: [2015-03-10 Fri 21:40] SCHEDULED: <2015-03-16 Mon>
http://emacs.stackexchange.com/questions/9945/links-open-firefox-with-starting-page-instead-of-link-content-linux
- [ ] post on user list if issue is not resolved by then.

*** DONE Pick up anthony laptop
CLOSED: [2015-03-13 Fri 14:00]
<2015-03-13 Fri 13:00>
*** DONE Figure out how to swap alt and command on my mac.
CLOSED: [2015-02-25 Wed 18:14]
:LOGBOOK:  
CLOCK: [2015-02-22 Sun 20:51]--[2015-02-22 Sun 23:16] =>  2:25
CLOCK: [2015-02-22 Sun 19:18]--[2015-02-22 Sun 19:43] =>  0:25
:END:      
:PROPERTIES:
:Effort:   1:00
:END:

Maybe try xkd 
https://wiki.archlinux.org/index.php/X_KeyBoard_extension

Super_L keycode 133
Alt_L   keycode 64
ls
Code from here solved it:
http://unix.stackexchange.com/questions/86933/swap-alt-and-super

But only bits of it:
keycode 64 = Alt_L
keycode 133 = Super_L
remove Mod1 = Alt_L
remove Mod4 = Super_L
add Mod1 = Super_L
add Mod4 = Alt_L

*** DONE [#B] Clear my dropbox down to a smaller size
CLOSED: [2015-02-23 Mon 11:45] SCHEDULED: <2015-02-20 Fri>
:LOGBOOK:  
CLOCK: [2015-02-23 Mon 11:29]--[2015-02-23 Mon 11:45] =>  0:16
CLOCK: [2015-02-23 Mon 10:59]--[2015-02-23 Mon 11:24] =>  0:25
:END:      
:PROPERTIES:
:Effort:   0:45
:END:

*** DONE Memorize Pom to time table 
CLOSED: [2015-06-10 Wed 11:19] SCHEDULED: <2015-06-08 Mon 16:30>
:LOGBOOK:
- State "DONE"       from "OPEN"       [2015-06-10 Wed 11:19]
:END:
- [ ] make entries in Anki. 
- [ ] Practice them.
* LSOMEDAY
** TODO migrate to i3 window manager.
Use tab mode like sergey mentioned.
** TODO learn to write your own man pages
http://www.cyberciti.biz/faq/linux-unix-creating-a-manpage/
* ETD                                                           :EMACS:
:LOGBOOK:  
CLOCK: [2015-03-13 Fri 13:41]--[2015-03-13 Fri 14:06] =>  0:25
CLOCK: [2015-03-04 Wed 10:34]--[2015-03-04 Wed 11:25] =>  0:51
CLOCK: [2015-03-04 Wed 10:01]--[2015-03-04 Wed 10:31] =>  0:30
CLOCK: [2015-03-04 Wed 09:25]--[2015-03-04 Wed 09:55] =>  0:30
CLOCK: [2015-03-04 Wed 09:04]--[2015-03-04 Wed 09:22] =>  0:18
CLOCK: [2015-03-03 Tue 17:06]--[2015-03-03 Tue 17:14] =>  0:08
CLOCK: [2015-03-02 Mon 15:43]--[2015-03-02 Mon 16:08] =>  0:25
CLOCK: [2015-03-02 Mon 14:40]--[2015-03-02 Mon 14:51] =>  0:11
CLOCK: [2015-03-02 Mon 14:13]--[2015-03-02 Mon 14:31] =>  0:18
CLOCK: [2015-03-02 Mon 11:52]--[2015-03-02 Mon 11:56] =>  0:04
CLOCK: [2015-03-02 Mon 09:46]--[2015-03-02 Mon 09:55] =>  0:09
:END:      
** OPEN [#A] .emacs to dotemacs
:LOGBOOK:  
CLOCK: [2015-04-11 Sat 12:00]--[2015-04-11 Sat 21:00] =>  9:00
CLOCK: [2015-04-06 Mon 20:09]--[2015-04-06 Mon 21:20] =>  1:11
CLOCK: [2015-04-06 Mon 19:07]--[2015-04-06 Mon 20:05] =>  0:58
CLOCK: [2015-03-19 Thu 18:55]--[2015-03-19 Thu 21:48] =>  2:53
CLOCK: [2015-03-26 Thu 18:45]--[2015-03-26 Thu 21:30] =>  2:45
CLOCK: [2015-03-26 Thu 17:34]--[2015-03-26 Thu 18:04] =>  0:30
CLOCK: [2015-03-13 Fri 18:10]--[2015-03-13 Fri 21:46] =>  3:36
CLOCK: [2015-03-20 Fri 20:28]--[2015-03-20 Fri 22:40] =>  2:12
CLOCK: [2015-03-17 Tue 17:08]--[2015-03-17 Tue 17:33] =>  0:25
CLOCK: [2015-03-12 Thu 21:20]--[2015-03-12 Thu 22:09] =>  0:49
CLOCK: [2015-03-12 Thu 20:44]--[2015-03-12 Thu 21:09] =>  0:25
CLOCK: [2015-03-12 Thu 20:30]--[2015-03-12 Thu 20:44] =>  0:14
:END:      
*** DONE Read about keyboard shortcuts.
CLOSED: [2015-03-19 Thu 21:48]
:LOGBOOK:  
CLOCK: [2015-03-19 Thu 18:20]--[2015-03-19 Thu 18:45] =>  0:25
CLOCK: [2015-03-19 Thu 17:38]--[2015-03-19 Thu 18:03] =>  0:25
:END:      
*** TODO Ensure org-mode is a sub-module of my ldts.
*** TODO Migrate customizer variables to dotemacs (as much as possible)
*** TODO migrate all key-assignments to bind-keys
** TODO [#C] update org-toc to toc-org.
** OPEN [#B] Norang traversal
Read/copy config of NoRang
http://doc.norang.ca/org-mode.html#text-AutoRevertMode
** OPEN [#B] Setup C/C++ development in Emacs
:LOGBOOK:
CLOCK: [2015-04-15 Wed 15:00]--[2015-04-15 Wed 19:20] =>  4:20
CLOCK: [2015-04-15 Wed 13:30]--[2015-04-15 Wed 14:24] =>  0:54
CLOCK: [2015-04-15 Wed 11:06]--[2015-04-15 Wed 11:52] =>  0:46
CLOCK: [2015-04-14 Tue 12:20]--[2015-04-14 Tue 15:20] =>  3:00
CLOCK: [2015-04-14 Tue 11:00]--[2015-04-14 Tue 11:14] =>  0:14
CLOCK: [2015-04-13 Mon 17:00]--[2015-04-13 Mon 17:30] =>  0:30
:END:
Also blog:
http://truongtx.me/2013/03/10/emacs-setting-up-perfect-environment-for-cc-programming/

Maybe experiment with CEDET
*** Addons to install:
projectile speed bar business 

*** References
Articles:
- [ ] [[http://tuhdo.github.io/c-ide.html][C/C++ Development Environment for Emacs]] http://tuhdo.github.io/c-ide.html
- [ ] https://martinralbrecht.wordpress.com/2014/11/03/c-development-with-emacs/

[[http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html][A Gentle introduction to CEDET]] http://alexott.net/en/writings/emacs-devenv/EmacsCedet.html
[[http://www.emacswiki.org/emacs/CEDET_Quickstart][EmacsWiki: CEDET Quickstart]] http://www.emacswiki.org/emacs/CEDET_Quickstart

Blogs
http://alexott.blogspot.ca/search/label/cedeta
https://truongtx.me/2013/03/10/emacs-setting-up-perfect-environment-for-cc-programming/

Youtube
[[https://www.youtube.com/watch?v=Ib914gNr0ys][Emacs as a C/C++ Editor/IDE (Part 3): Installing CEDET mode for true intellis...]]

Official sources
http://cedet.sourceforge.net/

** TODO [#C] Test out Projectile package for .git projects.
** TODO [#B] Sacha Config traversal.
http://pages.sachachua.com/.emacs.d/Sacha.html
** OPEN terminal-specific settings. 
- [ ] Add tags like "GUI", so that some code is loaded only via gui load
- [ ] write script to run emacs from terminal and load only certain bits.
** OPEN [#B] Tabs for emacs
:LOGBOOK:  
CLOCK: [2015-03-18 Wed 15:54]--[2015-03-18 Wed 16:01] =>  0:07
CLOCK: [2015-03-17 Tue 12:23]--[2015-03-17 Tue 12:39] =>  0:16
:END:      
:PROPERTIES:
:Effort:   3:00
:END:

My S.O post:
http://emacs.stackexchange.com/questions/10081/browser-style-tabs-for-emacs

TabBarMode doesn't quite do the thing:
http://emacswiki.org/emacs/TabBarMode
But maybe frameBuf + TabbarMode might work:
https://github.com/alpaker/Frame-Bufs

Emacs lisp screen seems interesting:
http://www.emacswiki.org/emacs/EmacsLispScreen
** OPEN [#B] Auto Complete, Spell check, PlantUML mode. 
:LOGBOOK:  
CLOCK: [2015-03-11 Wed 19:14]--[2015-03-11 Wed 19:41] =>  0:27
CLOCK: [2015-03-12 Thu 15:47]--[2015-03-12 Thu 15:47] =>  0:00
CLOCK: [2015-03-11 Wed 19:13]--[2015-03-11 Wed 19:14] =>  0:01
:END:      
*** DONE Autocomplete vs Compnay mode (Company mode)
CLOSED: [2015-04-13 Mon 11:21]
AutoComplete 
+ documentation
+ helm integration
+ org mode 

+ c/cheaders

Company mode 
+ Go
+ python (with jedi thingie)
+ statistical ranking of order with module.
+ abbrev 
+ yasnippet 
+++ used in C development guide: http://tuhdo.github.io/c-ide.html

Both
+ auctex
+ Popud docu  (compnay has 'quickhelp' module)
*** DONE Set up Company Mode
CLOSED: [2015-04-14 Tue 12:28]
- [ ] show digits next to suggestions?
*** TODO org-Auto-complete
https://github.com/aki2o/org-ac
*** TODO PlantUML mode 
** OPEN [#B] Babel / dynamic language (ditaa/Grahviz/plantUML) execution
:LOGBOOK:  
CLOCK: [2015-02-25 Wed 21:19]--[2015-02-25 Wed 22:14] =>  0:55
:END:      
:PROPERTIES:
:Effort:   3:00
:END:

- [ ] pull org-mode source. Follow guide: (see git hub link below).
http://doc.norang.ca/org-mode.html#Publishing

- [ ] probably need to learn about sub-modules.

Babel gudie:
http://orgmode.org/worg/org-contrib/babel/index.html

Intro:
http://orgmode.org/worg/org-contrib/babel/intro.html


Having a hard time getting 'ditaa.jar'. It is on git:
org-mode/contrib/scripts
https://github.com/tkf/org-mode/tree/master/contrib/scripts
** TODO [#C] Try to make use of graphviz mode
http://ppareit.github.io/graphviz-dot-mode/
- [ ] works on .dot files as oppose to working inside org-mode's editing.
but maybe there is a merge between them somehow?
** TODO [#C] Emacs and twitter. Follow Lars Vogella.
** TODO [#B] 1 Helm-swoop in indirect buffer.
Make some C-F5 maybe that will
clone indirect buffer
close other window 
do a helm swoop thing
then with C-F4 I can close this new indirect buffer.
** TODO [#C] encrypt org-files for password storage.
:PROPERTIES:
:Effort:   2:00
:END:
** TODO [#C] Convert - list :: into headings doesn't work well for multiple items.
** TODO [#C] Remove org-mode from ldts/extern.
:PROPERTIES:
:Effort:   0:30
:END:
** TODO [#C] cycle [ ] in headings
http://emacs.stackexchange.com/questions/9981/can-you-have-org-mode-headings-with-checkboxes
This might also be relevant:
org-cycle-include-plain-lists
** TODO [#B] define all my org files as agenda files.
** TODO [#B] Read keymaping article 
:PROPERTIES:
:Effort:   1:20
:END:
[[http://www.masteringemacs.org/article/mastering-key-bindings-emacs][Mastering Key Bindings in Emacs - Mastering Emacs]]
** TODO [#B] Figure out capture + refiling. 
:LOGBOOK:  
CLOCK: [2015-02-25 Wed 20:05]--[2015-02-25 Wed 20:30] =>  0:25
CLOCK: [2015-02-25 Wed 19:43]--[2015-02-25 Wed 20:03] =>  0:20
CLOCK: [2015-02-25 Wed 19:18]--[2015-02-25 Wed 19:43] =>  0:25
CLOCK: [2015-02-25 Wed 19:03]--[2015-02-25 Wed 19:18] =>  0:15
:END:      
:PROPERTIES:
:Effort:   1:00
:END:
*** Refiling 
Works  well with Capture + refiling. 
See detailed blog post: [[http://doc.norang.ca/org-mode.html#Refiling][Org Mode - Organize Your Life In Plain Text!]] 

By default, can refile to only 1st level headings in file. 
Cutomize VAR__ : org-refile-targets  

Good setup:
#+BEGIN_SRC elisp
(setq myvar/org-dir "~/git/LeoUfimtsev.github.io/org/")
(setq myvar/org-files (file-expand-wildcards (concat myvar/org-dir "*.org")))

;in your customize:
'(org-refile-targets
   (quote
    ((org-agenda-files :maxlevel . 10)
     (nil :maxlevel . 10)
     (myvar/org-files :maxlevel . 10))))
#+END_SRC






e.g to Max-Level = 6, or by regex or tag.
** TODO [#B] Total productivity by day.. 
:LOGBOOK:  
- Note taken on [2015-03-05 Thu 10:28] \\
  I closed the SO answer. But it may be useful to do as he says and chain things in babbel.
:END:      
- [X] I posted a question and found my own solution. (see org-generate..)
[[http://emacs.stackexchange.com/questions/9622/clockreport-total-productivity-by-day][org mode - clockreport, total productivity by day? - Emacs Stack Exchange]]
- [X] I should close the question if no one has answered or commented on it.
- [ ] I should automate this. Preferebly with babble somehow.
** TODO [#B] figure out table aggregator for life stats
https://github.com/tbanel/orgaggregate
Reccomended by "Thierry Banel" <tbanelwebmin@free.fr>

You may want to have a look at org-aggregate
It provides partial sums, means, and so on,
and also correlation between two columns.

Source code and documentation here:
  https://github.com/tbanel/orgaggregate

Also available as an Emacs package on Melpa:
  (require 'package)
  (add-to-list 'package-archives
    '("melpa" . "http://melpa.milkbox.net/packages")
    t)
  (package-initialize)
  M-x package-list-packages
  install orgtbl-aggregate

Thierry

  orgtbl-aggregate   20150104.818 available  melpa      Create an aggregated Org table from another one
  orgtbl-ascii-plot  20150125.... available  melpa      ascii-art bar plots in org-mode tables
  orgtbl-join        20150121.... available  melpa      join columns from another table
  orgtbl-show-header 20
** TODO [#B] Table formular readings
http://orgmode.org/worg/org-tutorials/org-spreadsheet-lisp-formulas.html
** TODO [#C] Learn emacs file management with dired
see quick [[http://ergoemacs.org/emacs/file_management.html][tutorial]]

** TODO [#C] Set up mail in emacs.
- [ ] ask lukas what he uses and ask for links to helpful articles. (mud)?.
** TODO [#C] update S.O answer about not showing reoccuring task entires via var:
http://emacs.stackexchange.com/questions/8159/make-org-agenda-show-only-first-occurrence-of-recurring-task
** TODO [#C] follow up on the est+ business 
http://emacs.stackexchange.com/questions/8218/how-to-use-est-field
** TODO [#C] smooth scroll, try to see how it scrolls with pictures
https://github.com/aspiers/smooth-scrolling
** TODO [#C] consider configuring helm global mark ring. [[*Back%20/%20forward%20navigation][See this]]
** TODO [#C] Write code to produce weekly report time sheet
:LOGBOOK:  
CLOCK: [2015-02-17 Tue 20:00]--[2015-02-17 Tue 21:46] =>  1:46
:END:      
:PROPERTIES:
:Effort:   0:30
:END:
Get rid of 'TODO/DONE' in weekly report 
Consider using advice as described in comment:
http://emacs.stackexchange.com/questions/8228/remove-task-state-keywords-todo-done-from-clocktable-reports?noredirect=1#comment12735_8228
https://www.gnu.org/software/emacs/manual/html_node/elisp/Advising-Functions.html

Implemented via regex find/replace. 

- [ ] Write a script to automatically export, open reports.txt and apply my report clearner.

- [ ] OR trim out TODO in the function org-clock-get-table-data via defadvice 
http://emacs.stackexchange.com/questions/8228/remove-task-state-keywords-todo-done-from-clocktable-reports
** TODO [#C] Assign key to mark-word backwards 
See my post:
http://emacs.stackexchange.com/questions/9810/can-you-mark-word-backwards
** TODO [#C] investigate org-screenshot 
:PROPERTIES:
:Effort:   2:00
:END:
https://github.com/dfeich/org-screenshot
** TODO [#C] Check out swipe to replace helm swoop. 
http://oremacs.com/2015/03/10/no-swiping/
https://github.com/abo-abo/swiper

- [ ] does it have swipe-all for all buffers?
** TODO [#C] Helm firefox 
Configure helm/firefox to search firefox bookmarks with helm:
https://github.com/emacs-helm/helm-firefox/blob/master/helm-firefox.el
** TODO [#C] Wordpress from org-mode 
:PROPERTIES:
:Effort:   3:00
:END:
[[https://github.com/punchagan/org2blog/][punchagan/org2blog · GitHub]]

Read blog guide:
https://dioferrari.wordpress.com/2014/11/07/publishing-in-wordpress-with-emacs-and-org2blog-2/

Could also investigate jekly, org2jekyll for example. 

** TODO [#C] Make an org-pomodoro-plus package and have it published on elpa.
** TODO [#C] edebug (figure it out)
https://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html
** TODO [#C] maybe migrate to oh-my-emacs
https://github.com/xiaohanyu/oh-my-emacs
** INCO [#A] Appending time for pomodoros doesn't function properly in LOGBOOK drawers.
CLOSED: [2015-06-24 Wed 12:38]
:LOGBOOK:  
- State "INCO"       from "DONE"       [2015-06-24 Wed 12:38]
- State "DONE"       from "PERSIST"    [2015-06-24 Wed 12:38]
- State "CANC"       from "PERSIST"    [2015-06-24 Wed 12:37]
- State "WAIT"       from "HOLD"       [2015-06-24 Wed 12:37]
- Note taken on [2015-04-30 Thu 12:26] \\
  checked, no progress made yet.
- Note taken on [2015-03-24 Tue 10:15] \\
  Still no work done on patch :-/
- Note taken on [2015-03-10 Tue 09:23] \\
  No work has been done on the patch.
- Note taken on [2015-03-03 Tue 09:40] \\
  Not merged at time of note. Need to check back later.
- Note taken on [2015-03-01 Sun 16:28] \\
  Awaiting fix to be mered to master. Checkback on after:
  https://github.com/lolownia/org-pomodoro/issues/26
CLOCK: [2015-02-26 Thu 19:26]--[2015-02-26 Thu 19:51] =>  0:25
CLOCK: [2015-02-26 Thu 18:53]--[2015-02-26 Thu 19:00] =>  0:07
CLOCK: [2015-02-26 Thu 18:51]--[2015-02-26 Thu 18:53] =>  0:02
CLOCK: [2015-02-26 Thu 18:30]--[2015-02-26 Thu 18:40] =>  0:10
CLOCK: [2015-02-26 Thu 18:30]--[2015-02-26 Thu 18:30] =>  0:00
:END:
https://github.com/lolownia/org-pomodoro/issues/26
** DONE [#D] EFIN
*** DONE [#A] Pomodoro-switch task doesn't function in agenda view. 
CLOSED: [2015-02-26 Thu 18:33]
:LOGBOOK:  
CLOCK: [2015-02-26 Thu 18:30]--[2015-02-26 Thu 18:30] =>  0:00
:END:      
- [X] make dynamic. 

(defun my/org-pomodoro-switch-to-task () 
 "Switch between tasks. I.e continue the pomodoro on another task"
 (interactive)
 
 (if (eq major-mode 'org-agenda-mode)
   (org-agenda-clock-in)
   (org-clock-in)
  ) 
)  

*** DONE [#A] Investigate diary logging. (find blog entry on this).
    CLOSED: [2015-02-25 Wed 18:56]
:LOGBOOK:  
CLOCK: [2015-02-25 Wed 17:25]--[2015-02-25 Wed 19:00] =>  1:35
:END:      
Maybe checkout the org-journal package.
[[https://github.com/bastibe/org-journal][bastibe/org-journal · GitHub]]
https://github.com/bastibe/org-journal
:PROPERTIES:
:Effort:   1:00
:END:
*** DONE [#A] Investigate diary logging. (find blog entry on this).
    CLOSED: [2015-02-25 Wed 18:56]
:LOGBOOK:  
CLOCK: [2015-02-25 Wed 17:25]--[2015-02-25 Wed 19:00] =>  1:35
:END:      
Maybe checkout the org-journal package.
[[https://github.com/bastibe/org-journal][bastibe/org-journal · GitHub]]
https://github.com/bastibe/org-journal
:PROPERTIES:
:Effort:   1:00
:END:
*** DONE [#B] Implement pomodoro continue
CLOSED: [2015-02-27 Fri 09:22] SCHEDULED: <2015-02-26 Thu>
:LOGBOOK:  
CLOCK: [2015-02-22 Sun 18:39]--[2015-02-22 Sun 18:40] =>  0:01

CLOCK: [2015-02-17 Tue 18:33]--[2015-02-17 Tue 19:50] =>  1:17
CLOCK: [2015-02-17 Tue 10:00]--[2015-02-17 Tue 14:12] =>  4:12
:END:      
:PROPERTIES:
:Effort:   5:20
:END:
- [X] cache last remaining time.
- [X] upon start, set var to previous time.
- [X] Submit git-hub request for continue in-other task function.
- [ ] F11 should trigger 'org-agenda-clock-in' if the agenda is open
  - [ ] Check which mode is active
    - [ ] Find out how to know if agenda mode is active
  - [ ] If it is, trigger a different action.

*** DONE [#B] pomodoro : replace my append time with one the new 
CLOSED: [2015-02-25 Wed 16:45]
- [ ] test with provided snippet actually works. 
- [ ] update my pomodoro package. 
- [ ] see if org-pomodoro-extend-last-clock is available 
as per: https://github.com/lolownia/org-pomodoro/issues/19
*** DONE Kill break when starting pomodoro.
CLOSED: [2015-02-25 Wed 16:46]
*** DONE [#B] fix \emsp in Agenda clocktable report. 
CLOSED: [2015-02-24 Tue 15:15]

- [ ] try code in S.O answer:
http://emacs.stackexchange.com/questions/9528/is-it-possible-to-remove-emsp-from-clock-report-but-preserve-indentation/9544#9544

Have issue that '\emsp' shows up all over like:
|            | [[file:/home/lufimtse/Dropbox/Uni/Notes/leo.org::OPEN%20NOW%20Configure%20REHL%206%20and%20REHL%207%20VM%20for%20testing][OPEN NOW Configure REHL 6 and REHL 7 VM for testing]]       | 0:54    |      |      |
|            | \emsp [[file:/home/lufimtse/Dropbox/Uni/Notes/leo.org::OPEN%20RHEL%207%20Config][OPEN RHEL 7 Config]]                                  |         | 0:41 |      |
|            | \emsp\emsp [[file:/home/lufimtse/Dropbox/Uni/Notes/leo.org::OPEN%20Configure%20DTS][OPEN Configure DTS]]                             |         |      | 0:21 |

Tried altering Org Agenda Clockreport paramater plist:
:indent t  (removes indent and \emsp)
:indent nil  (removes \emsp, but also removes indentdation)

*** DONE configure org-contribute business so it works at home
CLOSED: [2015-02-17 Tue 18:42]
:LOGBOOK:  
CLOCK: [2015-02-17 Tue 18:00]--[2015-02-17 Tue 18:43] =>  0:00
CLOCK: [2015-02-17 Tue 17:21]--[2015-02-17 Tue 17:22] =>  0:01
:END:      
*** DONE Link to parent
CLOSED: [2015-02-20 Fri 12:36]
- do a helm swoop global search of get-id and press 'return' -kinda macro.
*** DONE Toc on left side for org-mode readings
CLOSED: [2015-02-24 Tue 13:30]
:LOGBOOK:  
CLOCK: [2015-02-24 Tue 12:04]--[2015-02-24 Tue 12:41] =>  0:37
CLOCK: [2015-02-24 Tue 11:49]--[2015-02-24 Tue 11:57] =>  0:08
:END:      
S.O post: http://emacs.stackexchange.com/questions/9530/org-mode-is-it-possible-to-see-only-outline-in-2nd-buffer-like-dynamic-table/9532#9532



Opions:
- Speed bar 
  - [X] doesn't show all nested levels?
     http://emacs.stackexchange.com/questions/9533/speedbar-and-org-mode-only-shows-subheadings-but-not-3rd-level-subheadings
  - [X] how to integrate into same frame as speedbar? (sr-speedbar??)
- Sr-Bar with clone in-direct buffer. 
- Clone inderect buffer 
  - [X] click to move other pointer also?
    - [X] doesn't expand collapsed content. (my/goto ...) 
   http://emacs.stackexchange.com/questions/9536/move-to-other-cloned-buffer-to-same-point-sync-position-of-indirect-buffers

- [X] Imenu with org integratin? see: http://orgmode.org/manual/Cooperation.html
  Not quite what I want.

*** DONE Mate command to show Pomodoro time.
CLOSED: [2015-02-22 Sun 20:16]
:LOGBOOK:  
CLOCK: [2015-02-22 Sun 20:12]--[2015-02-22 Sun 20:16] =>  0:END
:END:      

*** DONE [#B] Migrate my .emacs to my ldts folder. 
CLOSED: [2015-02-22 Sun 18:37]
- [ ] remove any hard-references in my .emacs file.
- [ ] move .emacs file. 
- [ ] remove the syn link
- [ ] create a script to create the sym link.
- [ ] run the newly created script
- [ ] Test that emacs loads with the scrpit.
*** DONE [#B] Pomodoro: add title of current task to menu. Fix spacing.
CLOSED: [2015-03-02 Mon 09:57]
:LOGBOOK:  
CLOCK: [2015-03-02 Mon 09:55]--[2015-03-02 Mon 09:57] =>  0:02
CLOCK: [2015-03-01 Sun 17:41]--[2015-03-01 Sun 17:44] =>  0:03
CLOCK: [2015-03-01 Sun 17:38]--[2015-03-01 Sun 17:39] =>  0:01
CLOCK: [2015-03-01 Sun 17:37]--[2015-03-01 Sun 17:37] =>  0:00
CLOCK: [2015-03-01 Sun 17:35]--[2015-03-01 Sun 17:36] =>  0:01
CLOCK: [2015-03-01 Sun 17:33]--[2015-03-01 Sun 17:35] =>  0:02
CLOCK: [2015-03-01 Sun 16:55]--[2015-03-01 Sun 16:59] =>  0:04
CLOCK: [2015-03-01 Sun 16:46]--[2015-03-01 Sun 16:55] =>  0:09
CLOCK: [2015-03-01 Sun 16:30]--[2015-03-01 Sun 16:45] =>  0:15
:END:      
:PROPERTIES:
:Effort:   1:00
:END:

- [ ] for 3rd arg, use SED with regex & grouping.

*** DONE [#B] Drag-stuff, remap buttons or remove functinoality. 
CLOSED: [2015-03-02 Mon 10:21]
It clashes with moving of structured elements like list/heading items.
*** DONE [#B] Emacs notification system (pomodoro/Appointments)
CLOSED: [2015-03-11 Wed 19:13]
:LOGBOOK:  
CLOCK: [2015-03-02 Mon 16:44]--[2015-03-02 Mon 17:14] =>  0:30
:END:      
**** DONE [#B] Popus / notifications for Upcomming events 
CLOSED: [2015-03-11 Wed 19:12]
:LOGBOOK:  
CLOCK: [2015-03-04 Wed 19:33]--[2015-03-04 Wed 19:50] =>  0:17
CLOCK: [2015-03-04 Wed 18:07]--[2015-03-04 Wed 18:37] =>  0:30
:END:      
:PROPERTIES:
:ID:       0d84a7df-da9c-4087-ae2f-e3ace80558c7
:END:

- [ ] Ensure Notifiactions stay up for a long time.
- [ ] Ensure that they are reliable for re-scheduled items. (e.g for 1+ hour later...)
- [ ] Ensure that they are reliable for re-occuring items. (e.g bz triage)


Note for documentation:
Tried these: Notification pops up on time.
- Warning time : 1 
- Interval : 1

Tried:
- warn 1: inter: 0  // error on appt-check timer.
- warn 1: inter: 2 // Displays 1 minute before time. Displays only once. Not again.


With this, if you have something scheduled at 20:10, the first pop-up will be shown at 20:09

- [ ] follow up on: my so question
http://emacs.stackexchange.com/questions/9831/appt-desktop-notification-system-for-org-mode



See also task: [[id:d3fce39d-e323-4414-87d4-5a2e6d63a6b5][Pomodoro: replace YAD break timer with build-in notification.]]

Follow tutorial:
http://emacs-fu.blogspot.ca/2009/11/showing-pop-ups.html

Also check out dairy business with daily popu:
http://blog.danielgempesaw.com/post/109767231148/using-emacs-for-daily-reminders-to-write-in-my

appt ref:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Appointments.html

Reminders guide in norang:
http://doc.norang.ca/org-mode.html#ReminderSetup

Appointment (appt) notifications emacs guide:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Appointments.html

Org-list example setup:
http://permalink.gmane.org/gmane.emacs.orgmode/59339
**** DONE [#B] Pomodoro: replace YAD break timer with build-in notification.
CLOSED: [2015-03-04 Wed 18:39]
:LOGBOOK:  
CLOCK: [2015-03-04 Wed 17:54]--[2015-03-04 Wed 17:54] =>  0:00
CLOCK: [2015-03-04 Wed 17:42]--[2015-03-04 Wed 17:43] =>  0:01
CLOCK: [2015-03-04 Wed 17:42]--[2015-03-04 Wed 17:42] =>  0:00
CLOCK: [2015-03-04 Wed 17:38]--[2015-03-04 Wed 17:38] =>  0:00
CLOCK: [2015-03-04 Wed 17:36]--[2015-03-04 Wed 17:36] =>  0:00
CLOCK: [2015-03-04 Wed 17:34]--[2015-03-04 Wed 17:34] =>  0:00
CLOCK: [2015-03-04 Wed 17:32]--[2015-03-04 Wed 17:33] =>  0:01
CLOCK: [2015-03-04 Wed 17:31]--[2015-03-04 Wed 17:31] =>  0:00
CLOCK: [2015-03-04 Wed 17:29]--[2015-03-04 Wed 17:30] =>  0:01
CLOCK: [2015-03-04 Wed 17:25]--[2015-03-04 Wed 17:26] =>  0:01
CLOCK: [2015-03-04 Wed 17:21]--[2015-03-04 Wed 17:21] =>  0:00
CLOCK: [2015-03-04 Wed 17:18]--[2015-03-04 Wed 17:20] =>  0:02
CLOCK: [2015-03-04 Wed 17:06]--[2015-03-04 Wed 17:16] =>  0:10
CLOCK: [2015-03-04 Wed 16:33]--[2015-03-04 Wed 17:03] =>  0:30
:END:      
:PROPERTIES:
:Effort:   1:40
:ID:       d3fce39d-e323-4414-87d4-5a2e6d63a6b5
:END:

Relevant:
http://emacs-fu.blogspot.ca/2009/11/showing-pop-ups.html

See also task: [[id:0d84a7df-da9c-4087-ae2f-e3ace80558c7][Popus / notifications for Upcomming events]]
*** DONE [#B] Anki-like for org. Then use it to practice hotkeys in firefox.
CLOSED: [2015-03-12 Thu 20:29]
<2015-03-12 Thu 15:52>
:LOGBOOK:  
CLOCK: [2015-03-12 Thu 20:19]--[2015-03-12 Thu 20:29] =>  0:10
CLOCK: [2015-03-12 Thu 19:37]--[2015-03-12 Thu 20:02] =>  0:25
CLOCK: [2015-03-12 Thu 19:01]--[2015-03-12 Thu 19:26] =>  0:25
CLOCK: [2015-03-12 Thu 18:34]--[2015-03-12 Thu 18:59] =>  0:25
CLOCK: [2015-03-12 Thu 18:18]--[2015-03-12 Thu 18:34] =>  0:16
CLOCK: [2015-03-12 Thu 16:20]--[2015-03-12 Thu 17:43] =>  1:23
CLOCK: [2015-03-12 Thu 15:56]--[2015-03-12 Thu 16:15] =>  0:19
CLOCK: [2015-03-12 Thu 15:44]--[2015-03-12 Thu 15:44] =>  0:00
CLOCK: [2015-03-12 Thu 15:37]--[2015-03-12 Thu 15:44] =>  0:07
:END:      
*** DONE [#B] Load hooks only once 
CLOSED: [2015-03-19 Thu 15:55]
Need to figure out a method to read all hooks only once.
Asked on S.O about this.
http://emacs.stackexchange.com/questions/10150/how-to-deal-with-add-hook-in-emacs-when-its-reloaded-more-than-once
*** DONE [#B] Guide-key
CLOSED: [2015-04-10 Fri 15:47]
:LOGBOOK:
CLOCK: [2015-04-10 Fri 14:30]--[2015-04-10 Fri 15:46] =>  0:47
:END:
Hydra vs Guide key
- Guide-key ::
 + quick/dirty
 + works with existing bindings.
 + probably works well with bind-key.
 - messy sub-menu business.
 - can't assign custom names to menu items -> should assign keys to functions.

-  Hydra :: 
 + Cleaner looking menu 
 - time consuming to configure 
 + only works with my own made-menus
 - has quircks that make it less obvious how to bind things.
 - doesn't scale as well

Conclusion:
 Hydra is a menu system.
 Guide key is to help remember key-sequences. Should consider using bit of both.

*** DONE [#A] use-package
CLOSED: [2015-04-10 Fri 17:17]
:LOGBOOK:
CLOCK: [2015-04-10 Fri 16:00]--[2015-04-10 Fri 17:17] =>  1:17
CLOCK: [2015-04-10 Fri 15:48]--[2015-04-10 Fri 15:54] =>  0:06
:END:
*** DONE [#A] bind-key setup
CLOSED: [2015-04-12 Sun 00:50]
** TODO [#C] RSS feeds (from lifera..)
newssticker [build-in]
elfeed [external]
gnus+package? (overkill)

erc <<< Sacha reccomended. 

** ESOMEDAY
*** hide src begin code blocks
as per: 
http://emacs.stackexchange.com/questions/7211/collapse-src-blocks-in-org-mode-by-default
*** My own chooser support. 
Hook into org-ctrl-c-ctrl-c-final-hook 
read the line, 
if it contains ( ) -> (R) -> (M) -> (C)  (rejected maybe chosen)
*** Convert present action words to past tense. (Write -> wrote)
For my daily report, convert verbs via dictionary look up of some sort.
*** tracking time with org mode and pern (shows % on projects)
http://blogs.perl.org/users/steven_haryanto/2014/01/how-i-track-my-time-with-org-document-and-a-couple-of-perl-scripts.html
*** git in emacs

seems popular:
http://www.emacswiki.org/emacs/Magit
*** other... 
- [ ] Flash screen upon pomodoro finish with some utility.
- [ ] Investigate cleaner org-plus-contrib solution.
      e.s.o post: http://emacs.stackexchange.com/questions/8182/how-to-use-org-plus-contrib

- [ ] Investgiate cleaner mode-line
http://emacs.stackexchange.com/questions/8195/hook-for-mode-line-changes?noredirect=1#comment12521_8195

 Write a timer that will update the title bar 
(set-frame-parameter nil 'title (format-mode-line mode-line-format))

Try hooking into post-command-hook, then post response into s.o post.

I could also try the advise mentioned in post:
http://emacs.stackexchange.com/questions/8188/mode-line-in-title-bar/8196?noredirect=1#comment12520_8196

- [ ] Investigate AUCTEX mode. [[http://www.gnu.org/software/auctex/index.html][link]]
- [ ] Look at [[http://emacsrocks.com][Emacs_Rocks_videos]] 
- [ ] TODO Try to configure inline diagrams [d]
  Plant uml? 
  see: http://doc.norang.ca/org-mode.html#sec-16
  
  Inline diagram:
  https://github.com/bergey/org-babel-diagrams
  
  Diagramming
  https://github.com/josteink/wsd-mode

*** org-download, drag images into org-mode
https://github.com/abo-abo/org-download
* LEARN
:LOGBOOK:  
CLOCK: [2015-03-06 Fri 09:58]--[2015-03-06 Fri 09:58] =>  0:00
CLOCK: [2015-03-06 Fri 09:57]--[2015-03-06 Fri 09:57] =>  0:00
:END:      
** RHEL Certificate 
:PROPERTIES:
:Effort:   40:00
:END:
** Bike book
:LOGBOOK:
CLOCK: [2015-05-04 Mon 18:25]--[2015-05-04 Mon 18:55] =>  0:30
:END:
** LaTex + AUCTEX
** Bash Mastery 
:PROPERTIES:
:Effort:   15:00
:END:
** Python learning
** Java Learning
*** Effective Java 
*** Collections (read official docu)

** [#B] UML
:LOGBOOK:  
CLOCK: [2015-03-11 Wed 10:42]--[2015-03-11 Wed 11:07] =>  0:25
CLOCK: [2015-03-10 Tue 10:36]--[2015-03-10 Tue 11:18] =>  0:42
CLOCK: [2015-03-10 Tue 09:24]--[2015-03-10 Tue 09:54] =>  0:30
CLOCK: [2015-03-04 Wed 11:52]--[2015-03-04 Wed 11:53] =>  0:01
CLOCK: [2015-03-03 Tue 17:14]--[2015-03-03 Tue 17:36] =>  0:22
:END:      
:PROPERTIES:
:Effort:   10:00
:END:

These have PlantUML-like drawings:
- [X] IBM intor to uml http://www.ibm.com/developerworks/rational/library/769.html
- [ ] IBM tutorial on class diagrams: http://www.ibm.com/developerworks/rational/library/content/RationalEdge/sep04/bell/index.html
  - [ ] continue here: http://www.ibm.com/developerworks/rational/library/content/RationalEdge/sep04/bell/index.html#toc9

- [ ] IBM tutorial on Sequence diagrams:        http://www.ibm.com/developerworks/rational/library/3101.html
- [ ] maybe also: http://www.agilemodeling.com/artifacts/sequenceDiagram.htm


http://www.uml-diagrams.org/
http://www.tracemodeler.com/articles/a_quick_introduction_to_uml_sequence_diagrams/
* LRN FIN
* LStats 
@ 9:  2 - 8:50-
      1 - 9:00-
      0.5 - 9:10- 
      0   - 9:10+ 

press c-c }  to get grid info.
| Day              |  Dev |  Leo |        @ 9 | Sleep | Note |
|------------------+------+------+------------+-------+------|
| [2015-03-04 Wed] | 3:01 | 3:55 |          1 |  8:00 |      |
| [2015-03-05 Thu] | 4:00 | 0:52 |          0 |  7:39 |      |
| [2015-03-06 Fri] | 4:03 | 0:00 |         .5 |  8:00 |      |
| [2015-03-09 Mon] | 5:09 | 0:00 |          0 |  8:15 |      |
| [2015-03-10 Tue] | 3:14 | 1:12 |         .5 |  7:25 |      |
| [2015-03-11 Wed] | 4:55 | 0:53 |         .5 |  7:30 |      |
| [2015-03-12 Thu] | 2:31 | 4:58 |          0 |  7:24 |      |
| [2015-03-13 Fri] | 4:22 | 4:01 |          0 |  8:00 |      |
|                  |      |      |            |       |      |
| [2015-03-16 Mon] | 3:14 |      |         .5 |  8:00 |      |
| [2015-03-17 Tue] | 4:59 |      |          0 |  8:00 |      |
| [2015-03-18 Wed] |      |      |          0 |       |      |
| [2015-03-19 Thu] | 4:16 | 3:43 |          0 |  7:30 |      |
| [2015-03-20 Fri] |      |      |          0 |  7:52 |      |
| [2015-03-21 Sat] |      |      |            |       |      |
| [2015-03-22 Sun] |      |      |            |       |      |
| [2015-03-23 Mon] |      |      |            |       |      |
|------------------+------+------+------------+-------+------|
| March            |  3.0 |  3.9 | 0.33333333 |   7.8 |      |
#+TBLFM: @>$4=vmean(@I..@II)::@>$5=vmean(@I..@II);t%.1f::@>$2=vmean(@I$2);t%.1f::@>$3=vmean(@I$3);t%.1f


  | Date  | sleep | productivity | determination | coefficient |
  |-------+-------+--------------+---------------+-------------|
  | [meh] |  6.00 |         4.00 |               |             |
  | [meh] |  6.00 |         4.00 |               |             |
  | [meh] |  6.00 |         4.00 |               |             |
  | [meh] |  8.00 |         6.00 |               |             |
  | [meh] |  8.00 |         6.00 |               |             |
  | [meh] |  8.00 |         6.00 |               |             |
  |-------+-------+--------------+---------------+-------------|
  | 5.    |    5. |           6. |            6. |          1. |
  #+TBLFM: @>$1=fit(x, y, pack([2, 6], vconcat(@2$2..@-I$2, @2$3..@-I$3)))
  #+TBLFM: @>$2=vmean(@2$3..@-I$3)::@>$3=vsum((@2$3..@-I$3-@>$1)^2)
  #+TBLFM: @>$4=vsum((@2$3..@-I$3-@>$2)^2)::@>$5=sqrt(@>$3/@>$4)
